#!/bin/bash
while :
do
	echo -n "输入 1 到 5 之间的数字: "
	read NUM
	case $NUM in
		1|2|3|4|5) echo "你输入的数字为 $NUM !"
		;;
		*) echo "你输入的数字不是 1 到 5 之间的数字!"
			continue
			echo "游戏结束"
		;;
		
	esac

done

[root@mgr9 data]# ./13-04.sh 
输入 1 到 5 之间的数字: 1
你输入的数字为 1 !
输入 1 到 5 之间的数字: 5
你输入的数字为 5 !
输入 1 到 5 之间的数字: 10
你输入的数字不是 1 到 5 之间的数字!
输入 1 到 5 之间的数字: 5
你输入的数字为 5 !
输入 1 到 5 之间的数字: 1
你输入的数字为 1 !
输入 1 到 5 之间的数字: 3
你输入的数字为 3 !
输入 1 到 5 之间的数字: 0
你输入的数字不是 1 到 5 之间的数字!
输入 1 到 5 之间的数字: 


# 运行代码发现，当输入大于5的数字时，该例中的循环不会结束，语句 echo "游戏结束" 永远不会被执行。


