

0. 自我介绍
	这里自己介绍不行, 没有准备
	更新: 我来叫, 来自广西..., 今年27岁, 从事数据库相关工作已经3年有余, 熟悉监控 备份 复制 相关高可用 故障解决  相关数据库优化: 
		一些锁的优化, 比如死锁的分析和优化
		索引优化，比如表的许多个单列索引整合为联合索引 等, 会一些Python开发和PHP开发, 今天很高兴能来贵词面试, 接下来我很乐意回答面试官您提出的问题.

1. 你在公司主要做什么
	监控 备份 复制 相关高可用 故障解决  相关数据库优化
1. table_open_cache 参数怎么优化
2. 物理备份的原理
	备份1W多张InnoDB表, 会有什么问题
	持有全局锁的时间长
		--rsync
		使用rsync工具优化本地文件传输。它让xtrabackup使用rsync复制所有非innoDB文件，而不是使用多个cp
		
3. mysqld 占用 CPU 100%, SQL请求时快时慢, 怎么排查
	一般这种情况下都是慢查询或者有长时间未提交的事务造成的.
	show processlist 语句处于什么状态, 根据具体状态做具体分析
	innodb_trx
	查看IO利用率

4. 解决的故障, 举例两个以上
	delete 删除大表

5. keepalived 高可用会有什么问题
	
6. MGR + Consul 的原理
	这里描述得不好
	
7. 提升自己的沟通能力
	普通不标准, 在沟通方面会有一些问题, 乙方是经常需要跟客户沟通的
	不要重复说,思考好再说, 要一次性说清楚,说完成.
	自己比较适合甲方
	普通话不标准, 语速放慢点试试就会好点
	
8. 之后的职业生涯规划
	
9. 日常总结: 先说再写

10. 有什么开源项目吗

这次面试比之前好很多了, 敢说出来, 没有这么紧张了. 但是回答问题感觉没有回答到点子上.



个人的优点: 独立解决问题