
1. purge 大量的binary log
	比如 100多个GB的binlog文件
	
2. 行记录格式
	1. MySQL Server最多只允许4096个字段
	2. InnoDB 最多只能有1000个字段
	3. 字段长度加起来如果超过65535，MySQL server层就会拒绝创建表
	4. 字段长度加起来（根据溢出页指针来计算字段长度，大于40的，溢出，只算40个字节）如果超过8126，InnoDB拒绝创建表
	5. 表结构中根据Innodb的ROW_FORMAT的存储格式确定行内保留的字节数（20 VS 768），最终确定一行数据是否小于8126，如果大于8126，报错。
		-- 不包括溢出到大对象页单独存储的部分，实际存储到行记录中的长度，大于8KB，就会报插入数据错误。
		
	6. 行溢出
		1. 单个字段：
			字段长度大于8126，会触发行溢出
			
		2. 多个字段：
			-- compact 格式
				字段的总长度大于8126，单个字段实际存储的数据长度超过768字节的字段都会用溢出页作为数据存储的方式
				-- 这个是经过实验验证的。
				
			-- dynamic 格式
		