
1. MySQL反应慢的排查思路
	根据操作系统层、MySQL server层、InnoDB引擎层来分析

	操作系统层：
		看系统负载、CPU使用率、磁盘IO使用率
		只读长事务，查询了大量的数据，会导致系统负载高、CPU使用率很高
		DML大事务，操作了大量的数据，会导致3高：系统负载高、CPU使用率高、磁盘IO使用率高，同时会导致从库延迟
			查看长/大事务处于什么状态的办法：information_schmea.innodb_trx
			生产环境要监控长/大事务处
			
	MySQL server层：
		执行 show processlist 命令看看语句处于什么状态，根据每种状态分析它们的原理、如何处理、如何复现
		看看否有全局读锁和表级锁：比如全局读锁、MDL元数据锁、lock tables 表锁
		
	InnoDB引擎层:
		看看是否有行锁
		

	慢日志：
		查看期间的慢日志情况
		
	其它：
		1. 可能设置了事务延迟提交的binlog参数
		2. 在线缩小BP缓冲池空间，也可能导致业务阻塞。
	
	
2. web端到数据库慢的排查思路
	1. 有可能是数据库配置文件不小心改错了，指向了别的地址，导致数据加载慢
		这是在预发布环境遇到过的
	2. 网络原因
		现象1：请求返回慢
			之前在google服务器有遇到过，从游戏端访问数据库，从业务中监控到某时间段的请求返回慢
			经过排查和提交工单，反馈是网络原因导致的。
		现象2：请求返回超时
			从游戏端访问数据库，从业务中监控到某时间段的请求返回超时，导致获取不到数据
			经过排查和提交工单，反馈是网络原因导致的。	

	可以排除数据库本身慢的原因：期间没有慢日志，并且其它应用操作数据库是正常的。