
1、update语句
2、Online DDL
3、drop表
4、在线调整BP缓冲池大小
5、analyze table


通过updtate语句的执行流程构建MySQL知识网络； 



update语句的生命周期（执行流程），构建属于自己的MySQL知识网络； 

偏向于可以熟悉MySQL体系结构、InnoDB存储引擎，还可以通过对其进一步扩展，。


1-4的执行流程， 更偏向于日常运维，需要执行的SQL语句；熟悉对应的执行流程及可能会导致的业务影响，对数据库/业务的风险，有一定的把控能力；

当然，SQL上线，我们已实现平台化、自助化，执行日常的SQL上线单，权限粒度：人员、可执行时间；
高危SQL，rename table、drop table、delete语句等高危语句，只能DBA审计、执行；




怎么证明自己是不是真的把原理弄清楚了呢？答案是说出来、写出来。


通过github来运营



先把update语句的执行流程，梳理出来；
国庆后在叶老师的公众号投稿。
提升自己在业界的影响力。





































