#!/bin/bash


funWithParam(){
    echo "第一个参数为 $1 !"
    echo "第二个参数为 $2 !"
    echo "第九个参数为 $9 !"
    echo "第十个参数为 $10 !"
    echo "第十个参数为 ${10} !"
    echo "第十一个参数为 ${11} !"
    echo "第十二个参数为 $12 !"
    echo "参数总数有 $# 个!"
    echo "作为一个字符串输出所有参数 $* !"
}
funWithParam 1 2 3 4 5 6 7 8 9 34 73 12


# 输出
	第一个参数为 1 !
	第二个参数为 2 !
	第九个参数为 9 !
	第十个参数为 10 !
	第十个参数为 34 !
	第十一个参数为 73 !
	第十二个参数为 12 !
	参数总数有 12 个!
	作为一个字符串输出所有参数 1 2 3 4 5 6 7 8 9 34 73 12 !

注意，$10 不能获取第十个参数，获取第十个参数需要${10}。当n>=10时，需要使用${n}来获取参数。

