




1. 如果分析死锁：
	1. 死锁的概念  --没有描述完全。
	2. 举例来说什么是死锁    -- 可以描述完整的。
	3. 死锁分析的重点：
		结合死锁日志分析加锁规则，找出每个事务分别持有什么锁，在等待什么锁
		-- 这就是核心。
			找出每个事务分别持有哪个索引对应记录的行锁，在等待哪个索引对应记录的行锁
		
	4. 死锁的优化方向
		
2. 看过哪些源码
	-- 描述得不好，没有做分类。
	《2021-12-13 - 看过的源码分类.sql》
	
3. 回收表空间，其实就是重建整颗索引树。

4. 正常口述了 pt-osc 的原理。

5. 主要做的工作



没有问到他们的实例数和数据库量大概是什么样的

对我个人本次的面试评价




这个company主要是想招1个偏向于数据库的开发人员，可以参与做表结构的设计等。
























	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	