


2021-12-10 进行一面：



1. 自我介绍
	需要 MySQL 主要是1主1从或者1主2从的配置，1主2从中其中有1个从是延迟从库，MongoDB 是副本集模式。

2. 先介绍数据库实例数和架构
	18台MySQL数据库实例，架构为1主1从或者1主2从，1主2从里面其中有1个从库是延迟复制的从库
	
3. 容灾
	我回答的是备份和恢复
	
	其实要问的是两地三中心、
	
4. 从哪方面做 MySQL 的优化
	我回答的是 操作系统层、MySQL server层 和 InnoDB层
		其实可以更具体一点说
	
	问了内存参数的优化：
		我回答的是InnoDB最重要的内存参数，InnoDB buffer pool size缓冲池的大小，设置太大和太小分别带来的问题
		在5.7版本是可以修改的，自己也有在线修改过，没有造成业务的阻塞，因为我是在业务低峰期执行的，
		如果在业务高峰期缩小该参数的大小，会对内存buffer pool加 mutex 互斥锁，会阻塞业务的DML和查询请求。
		遍历instance，以instance为单位进行加锁，然后回收该instance的数据页，回收完成后释放buffer pool instance锁
		然后对整个BP缓冲池加锁，以chunk为单位进行回收内存。

		没有回答BP缓冲池参数的作用
		
	-- 《2021-11-07- MySQL的优化思路.sql》
	
	
5. binlog刷盘参数的优化

6. 主从复制的原理、扩展来讲延迟的原因和解决办法
	
7. 什么情况下会用不到索引？

	补充：扫描行数超过表行数的30%左右，SQL语句会用不到索引。
	
	
	
8. MongoDB大表在线加索引，会有什么问题？

	4.0 版本支持在后台添加索引，通过添加 background=true 这个参数，4.2 版本移除了这个参数，默认在后台添加索引。  --都是在不断优化的过程。
	
	经过测试，添加索引持有的锁(需要在构建索引的开始和结束阶段，加集合排他锁)+占用磁盘IO，一般会阻塞业务0.2秒左右。
	
	
	主要考虑副本模式下，会导致副本有延迟不？
		会的，但是副本(从库)没有业务的读取操作，那就还好。
		-- 需要验证下。
		
		
	内存不足，会导致添加索引报错吗？
		不会。
		
	4.0 之前的版本，是怎么处理的？
		会对集合加锁，阻塞对该集合的读和写请求。
		
	
一些职责：
	1. 保证数据库的平稳运行，不要时不时有大事务、死锁相关的问题，影响用户体验
	2. 不要在生产环境上随意做相关维护操作
	3. 要有上级领导的指示才能做，并且要有相关的记录
	4. 紧急操作，要有第二审核人，并且做好相关的回滚方案
	
MongoDB 4.0 以上的版本，副本集模式，对大表在线添加索引，你是怎么处理的

我记得你之前在你的公众号有写一篇相关的文章，应该对这个挺有经验的

在4.2版本，我之前有在业务停服后直接在主上加，没有什么问题啊
当时的数据和配置：30GB的单个集合数据大小，内部内存设置为8GB(wiredTigerCacheSizeGB=8GB)，物理内存16GB.

有人建议先在副本上加，然后副本集的切换，不过这个切换过程会导致业务有10秒左右的不可写





有基本的了解了
	
	公司相关：
		做sass平台的，面向的是to B市场，店铺销售、知识付费、直播等，现在直播业务是核心
	
	用户量相关：
		160W+客户数，同时在线有1000W+，终端用户数7.8亿
	
	数据库相关：
		主要有MySQL、MongoDB、Redis、ES，其中MySQL在腾讯云数据库上
	
	
	
	
2021-12-13 进行二面：
	
	0. 自我介绍
	
	1. 数据库上云比较稳定之后，DBA还需要做什么 
		1. 首先，不可能一直稳定的
		2. 从公司的角度
			可以考虑做一下容灾之类的
			看看业务跟数据库的交互有没有一些隐患之类的，提前做下优化，比如慢查询
			做自动化运维、往故障自愈方面思考
		3. 从个人的角度
			学习新版本的相关特性
			深入到源码层面做提升，更深入的理解MySQL，然后运用到工作上。
			
	2. 自建的数据库稳定之后，还需要做什么 或者 你在做什么
	
		1. 首先，不可能一直稳定的
		2. 从公司的角度
			可以考虑做一下容灾之类的
			看看业务跟数据库的交互有没有一些隐患之类的，提前做下优化，比如慢查询
			做自动化运维、往故障自愈方面思考
			
			
		3. 从个人的角度
			学习和研究新版本的相关特性
			深入到源码层面做提升，更深入的理解MySQL，然后运用到工作上。
		
		
	3. 个人职业发展规则
		主要往资深DBA方向发展。
		
	4. 一条查询语句的执行流程
	
	5. 自建的有高可用吗
		
		补充：使用 keepalive ，有发生过故障切换？  有的，上线前演练过（-- 补充：在业务停服更新的时候，有手工切换过，正常切换后，业务可以正常读写）。 

	6. 一条语句，第一次查询耗时100ms，第二次查询耗时10ms, 原因
		第一次查询已经把数据页加载到内存中，第二次查询，直接读取了内存数据页，然后返回，所以执行速度快


	7. 自建的MySQL，怎么做的监控？
		用的是fpmmm的模板，这个跟zabbix很搭。
	
	8. 为什么离职？
		主要是想有更大的提升，跟目前的公司没什么纠纷。
		要是能节前面试成功，节后上班的最好。
		
		
	小结：2面的时候，语速有放慢。
	
	
	
一面和二面都是用腾讯会议开视频，真的很耗电。







要问的问题：
    1. 实例数大概有多少，还有数据量有多少
    2. 用自建的数据库还是云数据库
        自建的话有高可用吗
    3. 用户量大概有多少 
	4. 主要使用的数据库产品有哪些
	5. 目前有DBA了吗
	
	
	































































