

SQL慢要么做了太多事，要么等的太久了。
	掌握一定延迟分布的观测方法，方能准确定位性能问题。
	--这个总结得可以。
	

1. 查询一行记录返回慢的现象(原因)的分析思路/复现和解决办法
	
2. 第一类：查询长时间不返回
	
    1.1 分析步骤
	
		1. 先执行 show processlist命令，看看当前语句处于什么状态；
		2. 针对每种状态，分析它们产生的原因、如何复现、如何处理。
	
    1.2 等MDL锁
    1.3 等flush关闭表
    1.4 等行锁
	
3. 第二类：查询慢
    MVCC的undo链表过长，导致查询慢。

--------------------------------------------------------------------------------------------
	
一条 SQL 语句执行的很慢, 得分以下两种情况来讨论:
	
	1、大多数情况是正常的，只是偶尔会出现很慢的情况。
		1. 
		
	2、在数据量不变的情况下，这条SQL语句一直以来都执行的很慢。
	
	
	
https://mp.weixin.qq.com/s/ry9Kfh9Z1Tx3ux9k-V15nA   一条SQL语句执行得很慢的原因有哪些？ 


