

5.7.17 版本开始支持MGR组复制功能。

优点：
	
	1. 数据的强一致性, 
		事务的提交，必须经过组内大多数节点(n/2+1)决议并通过，才能得以提交
		不会存在主从复制场景，当binlog没有发送给从库，此时主库宕机，高可用切换到从库，导致数据丢失的场景
		
		
	2. 不依赖外部组件就可以实现 故障自动检测和自动切换、在线手动切换、多点写入
		以前需要依赖外部组件实现高可用：keepalived、MHA 
		
	
缺点：

	1. 适配MGR的驱动没有做好。
		-- 主库宕机，会自动完成新的组复制架构，但是应用连接还是连接到了宕机的主库上。
		-- 需要中间件来实现。
	
		MongoDB 的驱动就做得很好，支持链接多数据库节点配置
	
	2. 不支持日志节点也就是仲裁节点
		Keepalived 做高可用, 只需要2个节点, 还可以增加1个节点做延迟复制的从库.
		
		
限制：

	1. 表的存储引擎必须是InnoDB
	2. 要开启GTID
	3. 表要有主键
	4. 基于binlog的逻辑复制，因此要开启binlog，并且binlog格式为row
	
	
小结：
	
	如果MGR的驱动做好了，就算是MGR有一些小bug，还是会有挺多公司使用的。
	
	总的来说, MGR还算不上是1个完整的高可用.
	
	
	
https://mp.weixin.qq.com/s/gYb3yE8IfiOFqkTvMYfjQA  MySQL Group Replication 能否在生产环境中大规模使用