
情况一：误删后还未重启MySQL
	1、使用lsof恢复
	
	情况二：误删后也重启MySQL了
	2、从备份中获取表结构
		2.1 物理备份
		从物理备份中直接把.frm文件拷贝回来。
		2.2 逻辑备份
		找到该表的DDL，在备用实例创建该表，再把.frm文件拷贝回来。
		
注意事项：
	1、无论是情况一还是情况二，都需要重新设置属主和属组。
	2、若恢复期间对该表执行了新的DDL，则上述方法可能都无效。
	3、本案例在MySQL 5.7.18版本（开启表独立空间模式）下亲测通过。


rm 命令简介：
	该命令用来删除Linux系统中的文件或目录。通常情况下rm不会删除目录，你必须通过指定参数-r或-R来删除目录。另外rm通常可以将该文件或目录恢复（注意，rm删除文件其实只是将指向数据块的索引点（information nodes）释放，只要不被覆盖，数据其实还在硬盘上。如果想要保证文件的内容无法复原，可以使用命令shred 。 
	另外一般还是要慎用rm -rf *这样的命令。
	
	
命令参数：	
	 1. -f 表示 强制删除，忽略不存在的文件，从不给出提示。
	 
	
小结：
	从目前测试的结果来看，删除命令要用 rm，不要用 rm -rf .
	原因主要有两个：
		1. rm 不带  -rf  删除文件，有类似二次确认的选项，而 rm -rf 并没有；
		2. rm 不带  -rf  删除文件, 通过 lsof 命令可以找到该文件。
			原因: rm删除文件其实只是将指向数据块的索引点（information nodes）释放，只要不被覆盖，数据其实还在硬盘上。
			
相关参考
	https://blog.csdn.net/yanzongshuai/article/details/78306115  MySQL误删除文件后，如何恢复
	https://blog.51cto.com/493689359/1785597    误删mysql数据库文件，使用lsof回恢复

	
思考 
	1. rm t.ibd 文件之后， 是否还可以对该表进行写入呢？
		答: 可以.
	2. rm -rf  和 rm  命令的区别？

		rm删除文件其实只是将指向数据块的索引点（information nodes）释放，只要不被覆盖，数据其实还在硬盘上。
		rm -rf 强制删除，忽略不存在的文件，从不给出提示, 并且无法还原.
		
		