




1. MDL读锁
2. InnoDB 表的 read only 锁，在短暂的阻塞用户写入更新删除（DML）的操作
3. flush tables 关闭打开的表，如果该表有慢查询，analyze table 操作会被阻塞，同时阻塞接下来其它线程对该表的访问。


------------------------------------------------------------------------------------------------------------------------


在analyze table的过程中会持有InnoDB 表的 read only 锁， 因此会存在短暂的阻塞用户写入更新删除（DML）的操作。 

除此之外analyze table 要把table 从 table definition cache 刷出来， 因此还会需要一个 flush lock(flush 关闭表)， 此时如果有长事务使用了这张表， 那么必须等待长事务结束。



统计信息收集是通过 dict_stats_update_persistent() 函数来完成的，具体收集算法这里不展开，其统计指标更新流程是：

	1. 持写锁
	2. 统计信息缓存清零
	3. 收集表和索引统计信息并更新缓存
	4. 释放写锁
	5. 持读锁获取缓存的快照
	6. 将快照持久化到系统表中

	http://mysql.taobao.org/monthly/2020/12/05/
	
	
	