
记录头信息

	用于描述记录的记录头信息，它是由固定的5个字节组成。5个字节也就是40个二进制位，不同的位代表不同的意思
	固定占 5 bytes, 包含下一条记录的位置，该行记录总长度，记录类型，是否被删除，对应的 slot 信息等	
	
		二进制位代表的详细信息如下表：

			名称			大小（单位：bit）	描述
			预留位1			1					没有使用
			预留位2			1					没有使用
			delete_mask		1					标记该记录是否被删除
			min_rec_mask	1					B+树的每层非叶子节点中的最小记录都会添加该标记
			n_owned			4					表示当前槽(slot)拥有的记录数
			heap_no			13					表示当前记录在记录堆的位置信息  -- 感觉像是记录在数据页中的编号
			record_type		3					表示当前记录的类型，0表示普通记录，1表示B+树非叶子节点记录，2表示最小记录，3表示最大记录
			next_record		16					表示下一条记录的相对位置




mysql> CREATE TABLE page_demo(
    ->     c1 INT,
    ->     c2 INT,
    ->     c3 VARCHAR(10000),
    ->     PRIMARY KEY (c1)
    -> ) CHARSET=ascii ROW_FORMAT=Compact;
Query OK, 0 rows affected (0.03 sec)

mysql> INSERT INTO page_demo VALUES(1, 100, 'aaaa'), (2, 200, 'bbbb'), (3, 300, 'cccc'), (4, 400, 'dddd');
Query OK, 4 rows affected (0.00 sec)
Records: 4  Duplicates: 0  Warnings: 0
	
	一共有6行记录：分别为最小值记录、最大值记录，还有4条真实的记录
	分为2组：
		第一组：最小值记录
		第二组：4条真实的记录 + 最大值记录
		

页目录(Page Directory)
	将每个组的最后一条记录的地址偏移量单独提取出来按顺序存储到靠近页的尾部的地方，这个地方就是所谓的Page Directory，也就是页目录（此时应该返回头看看页面各个部分的图）。
	
槽(Slot)
	页面目录中的这些地址偏移量被称为槽（英文名：Slot），所以这个页面目录就是由槽组成的。

对每个分组中的记录条数是有规定的：

	1. 最小记录所在的分组： 只能有 1 条记录
	2. 最大记录所在的分组： 拥有的记录条数只能在 1~8 条之间
	3. 剩下的分组：         记录的条数范围只能在是 4~8 条之间。
	
所以分组是按照下边的步骤进行的：


	1. 初始情况下一个数据页里只有最小记录和最大记录两条记录，它们分属于两个分组。

	2. 之后每插入一条记录，都会从页目录中找到主键值比本记录的主键值大并且差值最小的槽，
		然后把该槽对应的记录的n_owned值加1，表示本组内又添加了一条记录，直到该组中的记录数等于8个。

	3. 在一个组中的记录数等于8个后再插入一条记录时，会将组中的记录拆分成两个组，一个组中4条记录，另一个5条记录。
		
		这个过程会在页目录中新增一个槽来记录这个新增分组中最大的那条记录的偏移量。
	

继续往表中添加12条记录

mysql> INSERT INTO page_demo VALUES(5, 500, 'eeee'), (6, 600, 'ffff'), (7, 700, 'gggg'), (8, 800, 'hhhh'), (9, 900, 'iiii'), (10, 1000, 'jjjj'), (11, 1100, 'kkkk'), (12, 1200, 'llll'), (13, 1300, 'mmmm'), (14, 1400, 'nnnn'), (15, 1500, 'oooo'), (16, 1600, 'pppp');
Query OK, 12 rows affected (0.00 sec)
Records: 12  Duplicates: 0  Warnings: 0


现在页里边就一共有18条记录了（包括最小和最大记录），这些记录被分成了5个组，


现在看怎么从这个页目录中查找记录：

	因为各个槽代表的记录的主键值都是从小到大排序的，所以我们可以使用所谓的二分法来进行快速查找。
	5个槽的编号分别是：0、1、2、3、4，所以初始情况下最低的槽就是low=0，最高的槽就是high=4
	
	比方说我们想找主键值为6的记录，过程是这样的：
	
		
	