

100W行数据, 主键索引树高3层, 普通索引树高2层.

主键索引: 
	
	叶子节点存储的所有行记录的计算公式:
	叶子节点使用了 1743个page;
	一个叶子节点页有 574条记录;
	叶子节点最后一个数据页有 92行记录;
	
	mysql> select 1742 * 574 + 92;
	+-----------------+
	| 1742 * 574 + 92 |
	+-----------------+
	|         1000000 |
	+-----------------+
	1 row in set (0.00 sec)
	
	主键索引的叶子节点存储的是整行记录，包含了 事务ID(6个字节) 和 回滚指针(7个字节)。

	
辅助索引:	

	辅助索引的叶子节点使用了 832 个page;
	一个叶子节点页有 1203 条记录;
	辅助索引的叶子节点最后一个数据页有 307行记录;
	
	mysql> select 831 * 1203 + 307;
	+------------------+
	| 831 * 1203 + 307 |
	+------------------+
	|          1000000 |
	+------------------+
	1 row in set (0.00 sec)
		
主键索引和辅助索引虽然在记录上是一致的, 但是索引树的高度却不一定是一致的，因为主键索引的叶子节点存储的是整行记录，同时每行记录包含了隐藏字段： 事务ID 和 回滚指针。

	