


看源码的几个好处：

	从源码中学习如何性能优化、设计模式等

	深入源码，才能了解真相

	了解源码，才能更好的解决问题

	你懂源码，面试官更懂你


怎么读源码

	源码怎么读，才比较有效率？

	从问题出发，带着问题看源码

	面向debug/gdb学源码

	写写写，做笔记

	好了，希望大家都养成读源码的好习惯，轻松搞定面试官刨根问题的面试方式



	当然通过阅读源码去理解原理这件事情，看上去不简单，实际也不简单，我们需要有一些基础概念的理解，需要一些基础知识的铺垫。
	通过案例学习源码，会理解得更好。
	通过源码学习理论，就知道书上的描述对不对了。
	带问题看源码。
	面试的时候更有底气，也会成为自己的优势/加分项。

	
	源码的学习：没有速成方法，没有捷径，只有苦行僧般的坚持才能做好
	

MySQL 源码

	不放过源码中的每一处注释
	MySQL/InnoDB源码中，有很多注释，一些注释相当详细，对理解某一个函数/某一个功能模块都相当有用；
	同时要参考别人写的一些源码分析文章。
	
	
https://www.cnblogs.com/zengkefu/p/5674503.html