
通过原理和实验来理解。


死锁的概念：
	
	死锁是指两个或多个事务在同一资源上相互作用，并请求锁定对方占用的资源，从而导致恶性循环的现象。  #理解
	当多个事务试图以不同的顺序锁定资源时，就可能会产生死锁；
	多个事务同时锁定同一个资源时，也会产生死锁。
	By 高性能MySQL 第3版
	
	
	死锁是由于多个事务相互持有其他事务所需要的锁，结果导致事务都无法继续，进而触发死锁检测，其中某个事务会被回滚，释放相应的锁，其他事务得以正常继续；简言之，就是多个事务之间的锁等待产生了回路，死循环了；

	死锁发生时，会立刻被检测到，并且回滚其中某个事务，而不会长时间阻塞、等待；

	By 叶老师
	
	死锁是指两个或两个以上的事务在执行过程中， 因争夺锁资源而造成的一种互相等待现象。           #理解.
	By InnoDB存储引擎 第2版
	
	当并发系统中不同的线程出现循环资源依赖，涉及的线程都在等待别的线程释放资源时，就会导致这几个线程都进入无限等待的状态；称为死锁。
	By 丁奇 07 | 行锁功过：怎么减少行锁对性能的影响？
	
	概念不好理解， 就通过实验来理解概念/原理。
	
	
通过生活中的例子来理解死锁
	十字路口的红绿灯和车
	如果没有红绿灯，会发生什么？
		会发生交通堵塞。
	
	发起死锁检测, 发现死锁后, 主动回滚死锁链条中的某一个事务, 让其它事务得以继续进行。
	 
什么情况下会发生死锁，发生死锁时怎么处理


自己的理解：
	两个或者两个以上的事务在执行过程中，锁资源请求形成环路，进而触发死锁检测，让执行代价最小的事务回滚，从而让其它事务得以继续进行。
	--
	
	

总结：
	分析死锁，先看死锁的死锁类型
	
死锁类型：
	不同表相同记录行锁冲突
	相同表记录行锁冲突
	不同索引锁冲突
	gap锁冲突	


		
			
			