
1. 表结构和数据初始化
2. 删除 id=5 的记录
3. 重启MySQL 
4. 插入新的一行	
5. 小结


1. 表结构和数据初始化
	drop table if exists t;
	CREATE TABLE `t` (
	  `id` bigint(11) NOT NULL AUTO_INCREMENT,
	  `c` int(11) DEFAULT NULL,
	  `d` int(11) DEFAULT NULL,
	  PRIMARY KEY (`id`),
	  KEY `c` (`c`)
	) ENGINE=InnoDB  DEFAULT CHARSET=utf8mb4;
	
	DROP PROCEDURE IF EXISTS `idata`;
	DELIMITER ;;
	CREATE DEFINER=`root`@`%` PROCEDURE `idata`()
	begin
	  declare i int;
	  set i=1;
		start transaction;
	  while(i<=5) do
		INSERT INTO t (c,d) values (i,i);
		set i=i+1;
	  end while;
		commit;
	end
	;;
	DELIMITER ;

	call idata();
		
	
	
	root@mysqldb 20:58:  [test_db]> use db1;
	Database changed
	root@mysqldb 20:59:  [db1]> show create table t;
	+-------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
	| Table | Create Table                                                                                                                                                                                                         |
	+-------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
	| t     | CREATE TABLE `t` (
	  `id` bigint(11) NOT NULL AUTO_INCREMENT,
	  `c` int(11) DEFAULT NULL,
	  `d` int(11) DEFAULT NULL,
	  PRIMARY KEY (`id`),
	  KEY `c` (`c`)
	) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 |
	+-------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
	1 row in set (0.00 sec)

	root@mysqldb 20:59:  [db1]> select * from t;
	+----+------+------+
	| id | c    | d    |
	+----+------+------+
	|  1 |    1 |    1 |
	|  2 |    2 |    2 |
	|  3 |    3 |    3 |
	|  4 |    4 |    4 |
	|  5 |    5 |    5 |
	+----+------+------+
	5 rows in set (0.00 sec)


2. 删除 id=5 的记录

	root@mysqldb 20:59:  [db1]> delete from t where id=5;
	Query OK, 1 row affected (0.01 sec)

	root@mysqldb 20:59:  [db1]> select * from t;
	+----+------+------+
	| id | c    | d    |
	+----+------+------+
	|  1 |    1 |    1 |
	|  2 |    2 |    2 |
	|  3 |    3 |    3 |
	|  4 |    4 |    4 |
	+----+------+------+
	4 rows in set (0.01 sec)

	root@mysqldb 20:59:  [db1]> show create table t;
	+-------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
	| Table | Create Table                                                                                                                                                                                                         |
	+-------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
	| t     | CREATE TABLE `t` (
	  `id` bigint(11) NOT NULL AUTO_INCREMENT,
	  `c` int(11) DEFAULT NULL,
	  `d` int(11) DEFAULT NULL,
	  PRIMARY KEY (`id`),
	  KEY `c` (`c`)
	) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 |
	+-------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
	1 row in set (0.00 sec)
	
3. 重启MySQL 
	[root@mgr9 ~]# /etc/init.d/mysql restart
	Shutting down MySQL.... SUCCESS! 
	Starting MySQL... SUCCESS! 


	root@mysqldb 21:02:  [db1]> show create table t;
	+-------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
	| Table | Create Table                                                                                                                                                                                                         |
	+-------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
	| t     | CREATE TABLE `t` (
	  `id` bigint(11) NOT NULL AUTO_INCREMENT,
	  `c` int(11) DEFAULT NULL,
	  `d` int(11) DEFAULT NULL,
	  PRIMARY KEY (`id`),
	  KEY `c` (`c`)
	) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 |
	+-------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
	1 row in set (0.05 sec)

	root@mysqldb 21:08:  [db1]> select max(id)+1 from t;
	+-----------+
	| max(id)+1 |
	+-----------+
	|         5 |
	+-----------+
	1 row in set (0.00 sec)

4. 插入新的一行	
	root@mysqldb 21:02:  [db1]> INSERT INTO `t` (`c`, `d`) VALUES ('6', '6');  
	Query OK, 1 row affected (0.01 sec)

	root@mysqldb 21:03:  [db1]> select * from t;
	+----+------+------+
	| id | c    | d    |
	+----+------+------+
	|  1 |    1 |    1 |
	|  2 |    2 |    2 |
	|  3 |    3 |    3 |
	|  4 |    4 |    4 |
	|  5 |    6 |    6 |
	+----+------+------+
	5 rows in set (0.00 sec)

5. 小结
	在5.7版本的自增ID的保存策略中，当删除表的最后一行记录的时候，然后重启MySQL，再插入数据，自增ID会出现重复的。
	举例说明：
		数据表中有5行记录，当删除最后一行自增ID=5的记录，然后重启MySQL，再插入一行记录，此时的这一行记录的自增ID值还是为5.
		
		
	
	
	
	
