

副本集使用选举来确定哪个集合成员将成为主要成员。 副本集可以触发选举，以响应各种事件，例如：
	1. 向副本集添加新节点
	2. 初始化副本集
	3. 使用rs.stepDown()或rs.reconfig()之类的方法执行副本集维护，以及次要成员失去与主要成员的连接的时间超过了配置的超时时间（默认为10秒）。
		--rs.stepDown()的使用,参考笔记 <2020-06-18-修改成员状态.sql>
		
	
	即 触发选举的条件:
		初始化一个副本集时
		备份节点无法与主节点连通时
		主节点故障
		将Primary节点降级为Secondary节点： rs.setpDown()
		
		
在下图中，主节点不可用的时间超过了配置的超时时间，并触发了自动故障转移过程。 其余的辅助服务器之一要求选择新的主服务器并自动恢复正常操作。


副本集无法处理写入操作，直到选举成功完成。 如果从库有扛读的业务, 则副本集可以继续为读取查询提供服务。
										-- The replica set can continue to serve read queries if such queries are configured to run on secondaries.

假设默认副本配置设置，群集选择新的主数据库之前的中值时间通常不应超过12秒。 这包括将主要节点标记为不可用并致电并完成选举所需的时间。 您可以通过修改settings.electionTimeoutMillis复制配置选项来调整此时间段。 网络延迟之类的因素可能会延长完成副本集选举所需的时间，进而影响您的群集在没有主数据库的情况下可以运行的时间。 这些因素取决于您的特定群集体系结构。
										
您的应用程序连接逻辑应包括对自动故障转移和后续选举的容忍度。 从MongoDB 3.6开始，MongoDB驱动程序可以检测到主数据库的丢失，并可以自动重试某些写入操作，从而提供了自动故障转移和选择的其他内置处理：
	与MongoDB 4.2兼容的驱动程序默认情况下启用可重试写入
	与MongoDB 4.0和3.6兼容的驱动程序必须通过在连接字符串中包含 retryWrites = true 来显式启用可重试写入。
	

影响选举的因素和条件
	1. 复制选举协议 --Replication Election Protocol

		在版本4.0中进行了更改：MongoDB 4.0删除了不赞成使用的复制协议版本0。
		复制协议版本：1减少了副本集故障转移时间，并加快了多个同时存在的主数据库的检测。
		使用 protocolVersion(协议版本) 1，您可以使用catchUpTimeoutMillis在更快的故障转移和保留w：1写入之间确定优先级。
		
	2. 心跳 --Heartbeats
		副本集成员每两秒钟发送一次彼此的心跳（ping）。 如果心跳在10秒钟内未恢复，则其他成员会将无法访问的成员标记为无法访问。  --##################
		主节点与副本集的其它成员的连接断开超过10秒,  则认为主节点不可用, 这时候触发选举.
		
		
	3. 成员的优先级 --Member Priority

		副本集具有稳定的主副本后，选举算法将进行“尽力而为”尝试，以使具有最高优先级的辅助副本可以进行选举。 
		成员的优先权会影响选举的时间和结果； 具有较高优先级的中学的选举时间比具有较低优先级的中学的选举时间要早，而且更有可能获胜。 
		但是，即使有更高优先级的次要实例，也可以在短时间内将较低优先级的实例选为主要实例。 副本集成员继续进行选举，直到具有最高优先级的成员成为主要成员为止。
		
		优先级值为0的成员不能成为主要成员，也不能寻求选举
	
	4. 数据中心丢失 --Loss of a Data Center
		使用分布式副本集时，数据中心的丢失可能会影响其他一个或多个数据中心中其余成员选举主数据库的能力。
		
		如果可能，请在数据中心之间分布副本集成员，以最大程度地确保即使丢失数据中心，其余副本集成员之一也可以成为新的主要成员的可能性。
		
		-- 将副本集的其中一个从节点不跟主节点部署在同一个数据中心会更安全.
		
	5. 网络分区 --Network Partition

		网络分区可以将主节点隔离到少数节点的分区中。 
		当主节点检测到只能看到副本集中的少数节点时，该主节点将降为主节点并成为辅助节点。 
		独立地，可以与大多数节点（包括其自身）进行通信的分区中的成员进行选举以成为新的主节点。
		
	6. 投票成员 --Voting Members

		副本集成员配置设置 members[n].votes 和成员状态确定成员是否在选举中投票。
		选举中具有其 members[n].votes 设置等于1票的所有副本集成员。 要在选举中排除成员投票，请将成员的 members[n].votes 配置值更改为0。
		在版本3.2中进行了更改：
			非投票成员的优先级必须为0。
			优先级大于0的成员不能拥有0票。
		
		只有以下有投票权的成员才有资格投票：
			PRIMARY
			SECONDARY
			STARTUP2
			RECOVERING
			ARBITER
			ROLLBACK
			
	7. 非投票成员 --Non-Voting Members

		尽管无投票权的成员不会在选举中投票，但这些成员拥有副本集数据的副本，并且可以接受来自客户端应用程序的读取操作。
		由于副本集最多可以有50个成员，而只有7个有投票权的成员，因此非投票成员允许副本集具有七个以上的成员。
		
		非投票成员的优先级(priority)必须为0。
		
		例如，下面的九个成员副本集具有七个投票成员和两个非投票成员。

		

相关参考
	https://docs.mongodb.com/manual/core/replica-set-elections/
		Replication > Replica Set High Availability > Replica Set Elections
	
	https://mp.weixin.qq.com/s/a7OFkj-N2G0dYaLlkNCqVg   MongoDB WiredTiger存储引擎之二：一个Page的生命周期  --No4 自动故障转移
	
	
思考: 超时时间如何配置?
	settings.electionTimeoutMillis
