

> use local;
switched to db local
> db.oplog.rs.getIndexes();
[ ]


> use test_db;
switched to db test_db

> db.foo.insert({"bar" : "baz"})
WriteResult({ "nInserted" : 1 })

> db.foo.find()
{ "_id" : ObjectId("619b4b0b7f7f6d89b0dcdf68"), "bar" : "baz" }



-- 查询不到数据
> db.oplog.rs.find({"op" : "i","ns" : "test_db.foo",}).pretty()
> 

-- 查询不到数据

> db.oplog.rs.find({"ns" : "test_db.foo"})
> 

db.oplog.rs.find().limit(1).pretty();


------------------------------------------------------------------------------------------------------------------------------------

> db.table_clubgamelog.find().limit(1).pretty();
{
	"_id" : ObjectId("5efc0fd03f2609ef4eea1c78"),
	"nGameType" : 9,
	"tStartTime" : "2020-07-01 12:23:22",
	"tEndTime" : "new Date()",
	"szToken" : "10001-870730-1593577402-1-1",
	"LogData" : "{\"LogCount\":27,\"jsonlog\":[{\"1\":\"看三张新手房,底分 1\"},{\"2\":\"1 号位,携带金额 11575.425\"},{\"3\":\"2 号位,携带金额 463.591\"},{\"4\":\"3 号位,携带金额 413.56\"},{\"5\":\"4 号位,携带金额 129.875\"},{\"6\":\"发3张牌\"},{\"7\":\"抢庄\"},{\"8\":\"4 号位,开局第3秒,不抢\"},{\"9\":\"3 号位,开局第5秒,抢1倍\"},{\"10\":\"2 号位,开局第5秒,抢1倍\"},{\"11\":\"1 号位,开局第8秒,不抢\"},{\"12\":\"3 号位,开局第8秒,抢庄成功\"},{\"13\":\"下注\"},{\"14\":\"4 号位,开局第10秒,下4倍\"},{\"15\":\"2 号位,开局第11秒,下8倍\"},{\"16\":\"1 号位,开局第15秒,下1倍\"},{\"17\":\"补牌\"},{\"18\":\"开牌\"},{\"19\":\"4 号位,开局第17秒,开牌\"},{\"20\":\"2 号位,开局第18秒,开牌\"},{\"21\":\"3 号位,开局第18秒,开牌\"},{\"22\":\"1 号位,开局第21秒,开牌\"},{\"23\":\"结算\"},{\"24\":\"1 号位,闲,本局输赢分数0.95,牌值♣8♦K♦7♥3♥7,牛五*1,下注分数=1.0\"},{\"25\":\"2 号位,闲,本局输赢分数7.6,牌值♣Q♠4♣5♥9♥5,牛三*1,下注分数=8.0\"},{\"26\":\"3 号位,庄,本局输赢分数-17.0,牌值♦2♦Q♠3♣2♦5,牛二*1,下注分数=17.0\"},{\"27\":\"4 号位,闲,本局输赢分数7.6,牌值♣J♠8♥4♥A♥6,牛九*2,下注分数=8.0\"}],\"jsondata\":\"\"}",
	"nServerID" : 901
}


> db.oplog.rs.find({"op" : "i"}).pretty().sort({"o._id":-1}).limit(1)
{
	"ts" : Timestamp(1601366021, 4),     --时间戳
	"t" : NumberLong(27),
	"h" : NumberLong(0),
	"v" : 2,
	"op" : "i",
	"ns" : "yldb.table_clubgamelog",
	"ui" : UUID("28ff1a00-ec40-4d20-ba1e-68a56a76c5bb"),
	"wall" : ISODate("2020-09-29T07:53:41.028Z"),
	"o" : {
		"_id" : ObjectId("5f72e8043f2609ba55e484a7"),
		"nGameType" : 30,
		"tStartTime" : "2020-09-29 15:53:17",
		"CreateTime" : ISODate("2020-09-29T07:53:40Z"),
		"tEndTime" : "2020-09-29 15:53:40",
		"szToken" : "10001-302773-1601365997-1-9",
		"LogData" : "{\"LogCount\":18,\"jsonlog\":[{\"1\":\"德州扑克新手房,底分 1.0\"},{\"2\":\"玩家账户:130858座位号：9\"},{\"3\":\"2号位,携带金额79.144\"},{\"4\":\"3号位,携带金额116.701\"},{\"5\":\"4号位,携带金额304.035\"},{\"6\":\"9号位,携带金额10006.8\"},{\"7\":\"开局第0秒,9号位设置带入分数:20000\"},{\"8\":\"开局第0秒,9号位设置带入分数:20000\"},{\"9\":\"开局第0秒,9号位设置带入分数:20000\"},{\"10\":\"开局第0秒,9号位设置带入分数:200000\"},{\"11\":\"开局第0秒,9号位牌值♠6 ♣6  \"},{\"12\":\"开局第3秒,9号位加注,分值:1000\"},{\"13\":\"开局第12秒,9号位加注,分值:21000\"},{\"14\":\"开局第15秒,9号位加注,分值:19500.0\"},{\"15\":\"开局第20秒,9号位弃牌\"},{\"16\":\"开局第20秒,9号位加注,分值:0\"},{\"17\":\"开局第23秒,9号位加注,分值:19000\"},{\"18\":\"庄,本局输赢分数0.95,♠6♣6,,下注分数=1.0\"}],\"jsondata\":\"\"}",
		"nServerID" : 3001
	}

db.oplog.rs.find({ns : "yldb.table_clubgamelog"})
{
	"ts" : Timestamp(1592537451, 4),
	"t" : NumberLong(17),
	"h" : NumberLong(0),
	"v" : 2,
	"op" : "i",
	"ns" : "yldb.table_clubgamelog",
	"ui" : UUID("28ff1a00-ec40-4d20-ba1e-68a56a76c5bb"),
	"wall" : ISODate("2020-06-19T03:30:51.314Z"),
	"o" : {
		"_id" : ObjectId("5eec316a3f2609742c5a4024"),
		"nGameType" : 9,
		"tStartTime" : "2020-06-19 11:30:37",
		"tEndTime" : "2020-06-19 11:30:50",
		"szToken" : "10001-878817-1592537437-1-4",
		"LogData" : "{\"LogCount\":27,\"jsonlog\":[{\"1\":\"看三张新手房,底分 1\"},{\"2\":\"1 号位,携带金额 97.613\"},{\"3\":\"2 号位,携带金额 57.513\"},{\"4\":\"3 号位,携带金额 59.129\"},{\"5\":\"4 号位,携带金额 11865.228\"},{\"6\":\"发3张牌\"},{\"7\":\"抢庄\"},{\"8\":\"1 号位,开局第3秒,抢1倍\"},{\"9\":\"4 号位,开局第3秒,抢3倍\"},{\"10\":\"3 号位,开局第4秒,抢1倍\"},{\"11\":\"2 号位,开局第4秒,抢3倍\"},{\"12\":\"4 号位,开局第4秒,抢庄成功\"},{\"13\":\"下注\"},{\"14\":\"3 号位,开局第7秒,下2倍\"},{\"15\":\"1 号位,开局第7秒,下1倍\"},{\"16\":\"2 号位,开局第8秒,下7倍\"},{\"17\":\"补牌\"},{\"18\":\"开牌\"},{\"19\":\"4 号位,开局第10秒,开牌\"},{\"20\":\"2 号位,开局第11秒,开牌\"},{\"21\":\"1 号位,开局第11秒,开牌\"},{\"22\":\"3 号位,开局第12秒,开牌\"},{\"23\":\"结算\"},{\"24\":\"1 号位,闲,本局输赢分数-6.0,牌值♥5♣4♥4♠2♣9,牛四*1,下注分数=6.0\"},{\"25\":\"2 号位,闲,本局输赢分数-42.0,牌值♠10♣2♦8♣3♣J,牛三*1,下注分数=42.0\"},{\"26\":\"3 号位,闲,本局输赢分数-12.0,牌值♥7♦2♦9♣5♦K,无牛*1,下注分数=12.0\"},{\"27\":\"4 号位,庄,本局输赢分数57.0,牌值♦5♣A♠4♠A♣6,牛七*2,下注分数=60.0\"}],\"jsondata\":\"\"}",
		"nServerID" : 901
	}
}
