

1. 创建视图快照的时机不一样
	
	在可重复读隔离级别下，只需要在事务开始的时候创建一致性视图，之后事务里的其他查询都共用这个一致性视图；  -- 因此支持可重复读
	在读提交隔离级别下，每一个语句执行前都会重新算出一个新的视图。											 -- 因此不支持可重复读



2. 加锁方面的不一样

	2.1 insert into select 语句的加锁

	2.2 update join 关联更新语句的加锁

		RR/RC事务隔离级别下，驱动表的数据都是加写锁； 
		
		RC事务隔离级别下，关联到的被驱动表的数据不加锁；
		RR事务隔离级别下，关联到的被驱动表的数据加读锁；
		
			跟 insert into select 语句一样，RC事务隔离级别下， select 的语句不加锁; RR事务隔离级别下，select 的语句加读锁。
			
	2.3 读提交隔离级别下还有一个优化，即：
		
		全表扫描: 语句执行过程中加上的行锁，在语句执行完成后，就要把 不满足条件的行 上的行锁直接释放了，不需要等到事务提交。
		普通索引的范围等值查询, 需要访问到不满足条件的第一个值为止, 并且需要加锁, 语句结束不会把不满足条件的锁释放掉.
		主键索引的范围等值查询, 也是需要访问到不满足条件的第一个值为止, 并且需要加锁, 语句执行结束，如果该记录不符合查询条件，会释放掉这条记录的锁.
			
		
	2.4 加锁的基本单位：
		RC 为行锁。          						     -- 因此会有幻读。
		RR 为next-key锁，先加 gap lock, 再加 行锁。		 -- 因此消除了幻读。	
		RC 也会存在gap lock， 只发生在：
			唯一约束检查到有唯一冲突的时候，会加 S Next-key Lock，即对记录以及与和上一条记录之间的间隙加共享锁。

	


